
#Область ОбработчикиСобытий

//@skip-check module-accessibility-at-client
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	&Дата КАК Период,
	               |	&Склад КАК Склад,
	               |	ПокупкаТовары.Номенклатура,
	               |	СУММА(ПокупкаТовары.Количество) КАК Количество,
	               |	СУММА(ПокупкаТовары.Сумма) КАК Сумма
	               |ИЗ
	               |	Документ.Покупка.Товары КАК ПокупкаТовары
	               |ГДЕ
	               |	ПокупкаТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПокупкаТовары.Номенклатура";
	
	Движения.ТоварыНаСкладе.Записывать = Истина;
	Движения.ТоварыНаСкладе.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

#КонецОбласти