
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ТоварыНаСкладе.Записывать = Истина;
	Движения.ТоварыНаСкладе.Очистить();
    Движения.Записать();
	
	Движения.ТоварыНаСкладе.Записывать = Истина;
	
	БлокировкаРегистра = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаРегистра.Добавить("РегистрНакопления.ТоварыНаСкладе");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Номенклатура");
	ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
	БлокировкаРегистра.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПродажаТовары.Номенклатура,
	               |	СУММА(ПродажаТовары.Количество) КАК Количество
	               |ПОМЕСТИТЬ ВТ_ТаблицаСписания
	               |ИЗ
	               |	Документ.Продажа.Товары КАК ПродажаТовары
	               |ГДЕ
	               |	ПродажаТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажаТовары.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТаблицаСписания.Номенклатура,
	               |	ВТ_ТаблицаСписания.Количество КАК КоличествоСписания,
	               |	ЕСТЬNULL(ТоварыНаСкладеОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	               |	ЕСТЬNULL(ТоварыНаСкладеОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	               |	ПРЕДСТАВЛЕНИЕ(ВТ_ТаблицаСписания.Номенклатура) КАК НоменклатураПредставление
	               |ИЗ
	               |	ВТ_ТаблицаСписания КАК ВТ_ТаблицаСписания
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладе.Остатки(
	               |				&МоментВремени,
	               |				Номенклатура В
	               |						(ВЫБРАТЬ
	               |							ВТ_ТаблицаСписания.Номенклатура
	               |						ИЗ
	               |							ВТ_ТаблицаСписания)
	               |					И Склад = &Склад) КАК ТоварыНаСкладеОстатки
	               |		ПО ВТ_ТаблицаСписания.Номенклатура = ТоварыНаСкладеОстатки.Номенклатура";
	
	ВыборкаРезультат = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаРезультат.Следующий() Цикл
		Если ВыборкаРезультат.КоличествоСписания > ВыборкаРезультат.КоличествоОстаток Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = СтрШаблон("Для продажи номенклатуры %1 не хватает количества. Остаток на складе %2 ед.",
											ВыборкаРезультат.НоменклатураПредставление,ВыборкаРезультат.КоличествоОстаток);
			СообщениеПользователю.Сообщить();
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		
		Если Не Отказ Тогда
			ДвижениеРасход = Движения.ТоварыНаСкладе.ДобавитьРасход();
			ДвижениеРасход.Период = Дата;
			ДвижениеРасход.Склад = Склад;
			ДвижениеРасход.Номенклатура = ВыборкаРезультат.Номенклатура;			 
			ДвижениеРасход.Количество = ВыборкаРезультат.КоличествоСписания;
			ДвижениеРасход.Сумма = ВыборкаРезультат.КоличествоСписания/ВыборкаРезультат.КоличествоОстаток * ВыборкаРезультат.СуммаОстаток;			
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти