
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторЗадания    = Параметры.ИдентификаторЗадания;
	Если Параметры.Свойство("ИдентификаторНазначения") Тогда
		ИдентификаторНазначения = Параметры.ИдентификаторНазначения;
	КонецЕсли;	
	Элементы.НадписьВыполненияПроцесса.Заголовок = Параметры.ТекстВыполненияПроцесса;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбработкаОжиданияВыполненияФоновогоЗадания", 0.2, Истина);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаОжиданияВыполненияФоновогоЗадания() Экспорт

	Результат = РезультатВыполненияФоновогоЗадания();
	Если Не Результат.Завершено Тогда
		ПодключитьОбработчикОжидания("ОбработкаОжиданияВыполненияФоновогоЗадания", 0.2, Истина);
	Иначе
		Закрыть(Результат.ОшибкиВыполнения);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция РезультатВыполненияФоновогоЗадания()
		
	Результат = Новый Структура;
	Результат.Вставить("Завершено", Истина);
	МассивОшибок = Новый Массив;
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	
	Если Задание <> Неопределено Тогда	    
	    Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
	        Сообщения = Задание.ПолучитьСообщенияПользователю(); 
			Для каждого Сообщение Из Сообщения Цикл
				Попытка
					ПроцентВыполнения = Число(Сообщение.Текст);
				Исключение
					Продолжить;	
				КонецПопытки;	
			КонецЦикла;		
	        Результат.Вставить("Завершено", ПроцентВыполнения = 100);
		Иначе
			Сообщения = Задание.ПолучитьСообщенияПользователю();
			ПроцентВыполнения = Сообщения[Сообщения.ВГраница()].Текст;
			Для каждого Сообщение Из Сообщения Цикл
				Попытка
					перЧ = Число(Сообщение.Текст);
					Продолжить;
				Исключение
					Сообщение.ИдентификаторНазначения = ИдентификаторНазначения;
					МассивОшибок.Добавить(Сообщение);
				КонецПопытки;					
			КонецЦикла;	
	    КонецЕсли;		
	КонецЕсли;
	
	Результат.Вставить("ОшибкиВыполнения", МассивОшибок);
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти
