
&НаСервереБезКонтекста
Функция ЕстьПодчиненныеЭлементы(Проект)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ИСТИНА КАК Поле1
	               |ИЗ
	               |	Справочник.Справочник1 КАК Справочник1
	               |ГДЕ
	               |	Справочник1.Ссылка В ИЕРАРХИИ(&Проект)
				   |	И НЕ Справочник1.Ссылка = &Проект";
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции	

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбраннаяСтрока) Тогда
		Если ЕстьПодчиненныеЭлементы(ВыбраннаяСтрока) Тогда			
			СтандартнаяОбработка = Ложь;
			Сообщить("Выбор элементов, имеющих подчиненные проекты запрещен.");
			Возврат;			
		КонецЕсли;
		ЗначениеВыбрано = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	УстановитьДоступностьКомандыВыбора(ЭтотОбъект);	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКомандыВыбора(Форма)

	Элементы = Форма.Элементы;
	ТекСтрокаСсылка = Элементы.Список.ТекущаяСтрока;
	Если ЗначениеЗаполнено(ТекСтрокаСсылка) Тогда
		Если ЕстьПодчиненныеЭлементы(ТекСтрокаСсылка) Тогда
			Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаВыбрать.Доступность = Ложь;						
		Иначе
			Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаВыбрать.Доступность = Истина;	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры	
