#Если Сервер Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Справочник1.Ссылка
	               |ИЗ
	               |	Справочник.Справочник1 КАК Справочник1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Справочник1 КАК Справочник11
	               |		ПО Справочник1.Ссылка = Справочник11.Родитель
	               |ГДЕ
	               |	Справочник1.Наименование ПОДОБНО &СтрокаПоиска
	               |	И Справочник11.Родитель ЕСТЬ NULL"; 

	Запрос.УстановитьПараметр("СтрокаПоиска", "%" + Параметры.СтрокаПоиска + "%");

	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Список = Новый СписокЗначений;

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Список.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	ДанныеВыбора = Список;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
