
#Область ПрограммныйИнтерфейс

Процедура СоздатьДокументы(ПараметрыСоздания) Экспорт
	
	МассивПериоды = ПараметрыСоздания.МассивПериоды;
	ВидДокумента  = ПараметрыСоздания.ВидДокумента;
	Склад         = ПараметрыСоздания.Склад;
	КоличествоДокументовВДеньПоСкладу = ПараметрыСоздания.КоличествоДокументовВДеньПоСкладу;
	ВсегоДокументовСозданияПоСкладу   = ПараметрыСоздания.ВсегоДокументовСозданияПоСкладу;
	
	ТаблицаНоменклатуры = ПолучитьТаблицуНоменклатуры();
	СозданоДокументов = 0;
	
	ВсегоПериодов = МассивПериоды.Количество();
	КоличествоДокументовРаспределить = ВсегоДокументовСозданияПоСкладу - (КоличествоДокументовВДеньПоСкладу*ВсегоПериодов);
	Если КоличествоДокументовРаспределить > 0 Тогда
		КоличествоДокументовРаспределитьПериод = Окр(КоличествоДокументовРаспределить/ВсегоПериодов + 0.5);
	КонецЕсли;	

	Для ИндексПериода = 0 По ВсегоПериодов-1 Цикл
		
		Если КоличествоДокументовРаспределить > 0 Тогда
			КоличествоДокументовВДеньПоСкладу = КоличествоДокументовВДеньПоСкладу + 
				Мин(КоличествоДокументовРаспределитьПериод,КоличествоДокументовРаспределить);
			КоличествоДокументовРаспределить = КоличествоДокументовРаспределить - КоличествоДокументовРаспределитьПериод;
		Иначе	
			КоличествоДокументовВДеньПоСкладу = ПараметрыСоздания.КоличествоДокументовВДеньПоСкладу;	
		КонецЕсли;	
		
		Для НомерТекДокумента = 1 По КоличествоДокументовВДеньПоСкладу Цикл
			
			Если СозданоДокументов = ВсегоДокументовСозданияПоСкладу Тогда
				Прервать;
			КонецЕсли;
			
			НовыйДокумент       = Документы[ВидДокумента].СоздатьДокумент();
			НовыйДокумент.Дата  = МассивПериоды[ИндексПериода];
			НовыйДокумент.Склад = Склад;
			НовыйДокумент.Товары.Загрузить(ТаблицаНоменклатуры);
			
			Сообщение = Новый СообщениеПользователю;
			
			Попытка
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);													
			Исключение
				НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);				
				Сообщение.Текст = "Ошибка при проведении документа " + Строка(НовыйДокумент.Ссылка) + ":" + Символы.ПС + ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
			
			СозданоДокументов = СозданоДокументов + 1;
			Сообщение.Текст = СозданоДокументов*100/ВсегоДокументовСозданияПоСкладу;
			Сообщение.Сообщить();
			
		КонецЦикла;
		
		Если СозданоДокументов = ВсегоДокументовСозданияПоСкладу Тогда					
			Прервать;			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуНоменклатуры()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СправочникНоменклатура.Ссылка КАК Номенклатура,
	               |	0 КАК Количество,
	               |	0 КАК Цена,
	               |	0 КАК Сумма
	               |ИЗ
	               |	Справочник.Номенклатура КАК СправочникНоменклатура
	               |ГДЕ
	               |	НЕ СправочникНоменклатура.ПометкаУдаления";

	ТаблицаНоменклатуры = Запрос.Выполнить().Выгрузить();

	ГСЧКоличество = Новый ГенераторСлучайныхЧисел(1);
	ГСЧЦена       = Новый ГенераторСлучайныхЧисел(10);

	Для каждого Стр Из ТаблицаНоменклатуры Цикл
		Стр.Количество = ГСЧКоличество.СлучайноеЧисло(1,10);
		Стр.Цена       = ГСЧЦена.СлучайноеЧисло(10,100);
		Стр.Сумма      = Стр.Количество * Стр.Цена;
	КонецЦикла;
	
	Возврат ТаблицаНоменклатуры;
	
КонецФункции

#КонецОбласти	