
#Область ОбработчикиСобытийФормы

 &НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоСозданиеПокупка Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПериодСозданияДокументовПродажа"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ОбщееКоличествоДокументовПродажа"));
	Иначе
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПериодСозданияДокументовПокупка"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ОбщееКоличествоДокументовПокупка"));	
	КонецЕсли;	
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДокументыПокупка(Команда) 
	
	ЭтоСозданиеПокупка = Истина;
	Если ПроверитьЗаполнение() Тогда
		ИдентификаторыЗадания.Очистить();
		СоздатьДокументы("Покупка");
		Для каждого ИдЗадания Из ИдентификаторыЗадания Цикл
			ОткрытьФорму("Обработка.СозданиеПроведениеДокументовПокупкаПродажа.Форма.ФормаИндикация", 
				Новый Структура("ИдентификаторЗадания,ТекстВыполненияПроцесса",ИдЗадания.Значение,ИдЗадания.Представление),
				ЭтотОбъект, Истина);	
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыПродажа(Команда)
	
	ЭтоСозданиеПокупка = Ложь;
	Если ПроверитьЗаполнение() Тогда
		ИдентификаторыЗадания.Очистить();
		СоздатьДокументы("Продажа");
		ОповещениеПослеЗакрытия = Новый ОписаниеОповещения("ВывестиСообщенияПользователю",ЭтотОбъект);
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ИдентификаторНазначения",ЭтотОбъект.УникальныйИдентификатор); 
		Для каждого ИдЗадания Из ИдентификаторыЗадания Цикл
			ПараметрыОткрытия.Вставить("ИдентификаторЗадания", ИдЗадания.Значение);
			ПараметрыОткрытия.Вставить("ТекстВыполненияПроцесса", ИдЗадания.Представление);
			ОткрытьФорму("Обработка.СозданиеПроведениеДокументовПокупкаПродажа.Форма.ФормаИндикация", ПараметрыОткрытия,
				ЭтотОбъект, Истина,,,ОповещениеПослеЗакрытия);	
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьДокументы(ВидДокумента)
	
	ОбщееКоличествоДокументов = ЭтотОбъект["ОбщееКоличествоДокументов" + ВидДокумента];
	ПериодСозданияДокументов  = ЭтотОбъект["ПериодСозданияДокументов"  + ВидДокумента]; 
	ДатаНачалаСозданияДокументов    = НачалоДня(ПериодСозданияДокументов.ДатаНачала);
	ДатаОкончанияСозданияДокументов = НачалоДня(ПериодСозданияДокументов.ДатаОкончания);
	
	МассивПериоды = ПолучитьМассивПериодовСозданияДокумента(ДатаНачалаСозданияДокументов,ДатаОкончанияСозданияДокументов,ВидДокумента);  
	КоличествоРабочихДней = МассивПериоды.Количество();
	
	Если КоличествоРабочихДней Тогда		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Склады.Ссылка КАК Склад,
		               |	ПРЕДСТАВЛЕНИЕ(Склады.Ссылка) КАК СкладПредставление
		               |ИЗ
		               |	Справочник.Склады КАК Склады
		               |ГДЕ
		               |	НЕ Склады.ПометкаУдаления";

		ВыборкаСклады = Запрос.Выполнить().Выбрать();		
		КоличествоСкладов = ВыборкаСклады.Количество();
		
		Если КоличествоСкладов Тогда		
   			
			ОстатокДокументовСозданияПоСкладам = 0;
			Если ОбщееКоличествоДокументов%КоличествоСкладов = ОбщееКоличествоДокументов Тогда
				КоличествоДокументовВДеньПоСкладу = 1;
				ВсегоДокументовСозданияПоСкладу = 1;	
			Иначе
				КоличествоДокументовВДеньПоСкладу = Окр(ОбщееКоличествоДокументов/КоличествоРабочихДней/КоличествоСкладов);
				Если КоличествоДокументовВДеньПоСкладу < 1 Тогда 
					КоличествоДокументовВДеньПоСкладу = 1;
				КонецЕсли;	
				ВсегоДокументовСозданияПоСкладу = Мин(Цел(ОбщееКоличествоДокументов/КоличествоСкладов),
					КоличествоДокументовВДеньПоСкладу*КоличествоРабочихДней);  
				ОстатокДокументовСозданияПоСкладам = ОбщееКоличествоДокументов - (ВсегоДокументовСозданияПоСкладу*КоличествоСкладов);
				ОстатокДокументовСозданияНаСклад   = Окр(ОстатокДокументовСозданияПоСкладам/КоличествоСкладов + 0.5);
			КонецЕсли;			
						
			ПараметрыСоздания = Новый Структура;			
			ПараметрыСоздания.Вставить("КоличествоДокументовВДеньПоСкладу", КоличествоДокументовВДеньПоСкладу);
			ПараметрыСоздания.Вставить("ВидДокумента", ВидДокумента);
			ПараметрыСоздания.Вставить("МассивПериоды", МассивПериоды);				
			
			КоличествоДокументовСоздания = 0;
						
			Пока ВыборкаСклады.Следующий() Цикл
				
				Если КоличествоДокументовСоздания = ОбщееКоличествоДокументов Тогда
					Прервать;										
				КонецЕсли;
				
				Если ОстатокДокументовСозданияПоСкладам > 0 Тогда
					ПараметрыСоздания.Вставить("ВсегоДокументовСозданияПоСкладу", ВсегоДокументовСозданияПоСкладу + 
						Мин(ОстатокДокументовСозданияНаСклад,ОстатокДокументовСозданияПоСкладам));
					ОстатокДокументовСозданияПоСкладам = ОстатокДокументовСозданияПоСкладам - ОстатокДокументовСозданияНаСклад;
				Иначе	
					ПараметрыСоздания.Вставить("ВсегоДокументовСозданияПоСкладу", ВсегоДокументовСозданияПоСкладу);	
				КонецЕсли;
				
				КоличествоДокументовСоздания = КоличествоДокументовСоздания + ПараметрыСоздания.ВсегоДокументовСозданияПоСкладу;
				
				ПараметрыСоздания.Вставить("Склад", ВыборкаСклады.Склад); 
				МассивПараметрыЗадания = Новый Массив;
				МассивПараметрыЗадания.Добавить(ПараметрыСоздания);
				
				КлючЗадания         = "СозданиеДокументов" + ВидДокумента + ВыборкаСклады.СкладПредставление; 
				НаименованиеЗадания = "Создание документов """ + ВидДокумента + """ по складу " + ВыборкаСклады.СкладПредставление;
				ФоновоеЗадание = ФоновыеЗадания.Выполнить("СозданиеДокументовВФонеСервер.СоздатьДокументы",МассивПараметрыЗадания,
					КлючЗадания,НаименованиеЗадания);
				ИдентификаторыЗадания.Добавить(ФоновоеЗадание.УникальныйИдентификатор,НаименованиеЗадания);
				
			КонецЦикла;
	   		
	    КонецЕсли;
	Иначе
		Сообщить("Для создания документов """ + ВидДокумента + """ нет рабочих дней в указанном периоде.");	
	КонецЕсли;	

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивПериодовСозданияДокумента(ДатаНачалаСозданияДокументов,ДатаОкончанияСозданияДокументов,ВидДокумента)
	
	МассивПериоды = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(&НачалоПериода КАК ДАТА) КАК ДатаПериода
	               |ИТОГИ ПО
	               |	ДатаПериода ПЕРИОДАМИ(ДЕНЬ, &НачалоПериода, &КонецПериода)";
	
	Запрос.УстановитьПараметр("НачалоПериода",ДатаНачалаСозданияДокументов);
	Запрос.УстановитьПараметр("КонецПериода",ДатаОкончанияСозданияДокументов);
	
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ДатаПериода","ВСЕ");
	
	Если ВидДокумента = "Продажа" Тогда
		ДобавитьСекунд = 15*3600;	
	Иначе
		ДобавитьСекунд = 9*3600;	
	КонецЕсли;
	
	Пока Результат.Следующий() Цикл
		Если ДеньНедели(Результат.ДатаПериода) < 6 Тогда
			МассивПериоды.Добавить(Результат.ДатаПериода + ДобавитьСекунд);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат МассивПериоды;
	
КонецФункции

&НаКлиенте
Процедура ВывестиСообщенияПользователю(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		Для каждого СообщениеПользователю Из Результат Цикл
			СообщениеПользователю.Сообщить();
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры	

#КонецОбласти